package com.mandziak.n;

public class Controll {

}

/*
Клас обов’язково реалізує наступні функції.
Читання завдання до контролю з файлу.
Читання еталонних відповідей з файлу.
Надання студенту завдань до контролю знань.
Оцінювання кожної відповіді.
Клас додатково може реалізувати наступні функції відповідно до конкретного
завдання до курсової роботи.

Встановлюється термін підготовки відповіді.

2.1.Завдання типу «вибір альтернативної відповіді».
2.2. Завдання типу «вставити необхідне».
2.3. Завдання типу «отримати значення».
2.4. Завдання типу «вказати місце помилки».
2.5.Контроль повинен відбуватися наприкінці кожної порції.
2.6.Контроль повинен відбуватися наприкінці кожного розділу.
2.7.Контроль повинен відбуватися наприкінці кожного сеансу навчання.
2.8.Контроль повинен відбуватися наприкінці курсу навчання.
2.10.Фіксується час підготовки відповіді.
 */
