package com.mandziak.n;

public class InMaterial {

}

/*
Клас обов’язково реалізує наступні функції.
Введення учбового матеріалу у форматі, що задано іншими пунктами завдання.
Введення контрольних завдань у форматі, що задано іншими пунктами завдання.
Введення еталонів відповідей у форматі, що задано іншими пунктами завдання.
Клас додатково може реалізувати наступні функції відповідно до конкретного
завдання до курсової роботи.

4.3.Клас дозволяє коригувати дані після закінчення сеансу їх введення, якщо
представлено пароль.

4.1.Клас приймає дані тільки у діалоговому режимі.
4.2.Клас може приймати дані з іншого носія, що не входить до системи.
4.4.Клас дозволяє переглядати контрольні завдання та еталони відповідей, якщо
представлено пароль.
4.5.Клас дозволяє ввести список студентів, що мають вивчати даний предмет.
 */