package com.mandziak.n;

public class Registration {

}

/*
Клас обов’язково реалізує наступні функції.
Приймає дані щодо студента.
Видає підсумковий документ.
Клас додатково може реалізувати наступні функції відповідно до конкретного
завдання до курсової роботи.

3.7. Підсумковий документ містить назви тем, по яким студент мав незадовільні
оцінки.

3.1. Список студентів введено заздалегідь. Студент відшукує своє прізвище, читає
пароль, після цього пароль не можна прочитати.
3.2. Кожен студент повинен пройти реєстрацію сам. Він встановлює собі пароль.
3.3. Підсумковий документ містить тільки загальну оцінку.
3.4. Підсумковий документ містить усю історію навчання.
3.5. Підсумковий документ містить усі оцінки по порціям.
3.6. Підсумковий документ містить загальний час навчання.
 */