package com.mandziak.n;

public class StudingProcessControll {

}

/*
Клас обов’язково реалізує наступні функції.
Перегляд результатів навчання для кожного студента.
Клас додатково може реалізувати наступні функції відповідно до конкретного
завдання до курсової роботи.

5.4.Отримання даних щодо тем, які успішно пройшов конкретний студент.

5.1.Отримання даних щодо загального часу навчання конкретного студента.
5.2.Отримання даних щодо кількості сеансів навчання для конкретного студента.
5.3.Отримання даних щодо оцінок, які виставлено системою для конкретного
студента.
 */